SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
#include "stm32f10x.h"
#include "stm32f10x_can.h"
#include "Delay.h"
#include "YbImu.h"
#include <math.h>

/*==========================================================================
 * 两驱差速清扫车 —— STM32 底盘板
 *
 *   USART1  PA9(TX) / PA10(RX)  <->  上位机 CH340 / RK3588   115200 8N-1
 *   CAN1    PA12(TX)/ PA11(RX)  -->  两台 FOC 驱动器          500 kbps 扩展帧
 *   PB10/PB11                   <->  亚博 YbImu (软件 I2C)
 *   PB0 / PB1                   -->  电机继电器 / 水泵继电器
 *
 * 只有一个上位机(RK3588)。**定位不在本板做**: 卡尔曼滤波在上位机跑,
 * 本板只出运动学、CAN 下发、看门狗、继电器和状态上报。PA2/PA3 空着。
 *
 * STM32 负责:
 *   1. 解析上位机发来的车体目标速度 (vx, vy, wz)
 *   2. 差速逆解 -> 左右轮目标转速 -> CAN 下发
 *   3. 轮速正解 + 读 IMU -> 按协议上报
 *   4. 看门狗: 上位机静默 800ms 就自动停车, 并断开继电器
 *
 * ---------------------------------------------------------------------------
 * 协议沿用 Wheeltec 底盘那套 (见 chassis_serial_control.md)
 *
 * 【命令帧 11 字节  上位机 -> STM32】
 *   [0]    0x7B          帧头
 *   [1]    AutoRecharge  正常走车 = 0
 *   [2]    SecurityPLY   正常走车 = 0
 *   [3-4]  int16 BE      vx * 1000   mm/s
 *   [5-6]  int16 BE      vy * 1000   mm/s    (差速车忽略)
 *   [7-8]  int16 BE      wz * 1000   mrad/s
 *   [9]    BCC = XOR([0..8])
 *   [10]   0x7D          帧尾
 *
 * 【主遥测帧 24 字节  STM32 -> 上位机】  (完全按厂商协议标准)
 *   [0]    0x7B
 *   [1]    Flag_Stop
 *   [2-3]  int16 BE 车体 vx   mm/s
 *   [4-5]  int16 BE 车体 vy   mm/s
 *   [6-7]  int16 BE 车体 wz   mrad/s
 *   [8-9]  int16 BE IMU ax 原始值
 *   [10-11]        ay
 *   [12-13]        az
 *   [14-15]        gx
 *   [16-17]        gy
 *   [18-19]        gz
 *   [20-21] uint16 BE 电池电压 mV
 *   [22]   BCC = XOR([0..21])
 *   [23]   0x7D
 *
 * 【扩展诊断帧 36 字节  STM32 -> 上位机】  (本工程自定义, 头 0x7E)
 *   厂商 ROS 节点不认识这一帧。它靠"上一字节是帧尾 0x7D、本字节是 0x7B"
 *   才入帧, 而本帧永远夹在两个完整 24 字节帧之间发出, 所以它会被完整跳过、
 *   并在下一个 0x7B 处正常重新同步 —— 不需要厂商那边做任何改动。
 *   解析脚本: tools/decode_diag.py
 *   [0]     0x7E
 *   [1]     flags  bit0 曾收到命令  bit1 看门狗已停车  bit2 IMU 加速度有效
 *                  bit3 IMU 陀螺仪自开机以来读到过非零
 *                  bit4 上次复位是 IWDG 引起的(说明主循环卡死过, 要查!)
 *   [2-3]   int16 BE 车体 vx   mm/s     (轮速正解)
 *   [4-5]   int16 BE 车体 wz   mrad/s
 *   [6-7]   int16 BE 左轮 实际转速 RPM
 *   [8-9]   int16 BE 右轮 实际转速 RPM
 *   [10-11] int16 BE 左轮 目标转速 RPM
 *   [12-13] int16 BE 右轮 目标转速 RPM
 *   [14-15] int16 BE 1号驱动器 输出扭矩电流  A×100
 *   [16-17] int16 BE 2号驱动器 输出扭矩电流  A×100
 *   [18]    1号驱动器 故障码   (见 FOC_FAULT_*)
 *   [19]    2号驱动器 故障码
 *   [20]    1号驱动器 当前运行模式  (0x05 速度 / 0x06 位置 ...)
 *   [21]    2号驱动器 当前运行模式
 *   [22]    CAN 发送错误计数
 *   [23]    UART 坏帧计数
 *   [24]    UART 有效命令计数
 *   [25]    UART 溢出计数
 *   [26]    继电器状态  bit0 电机 bit1 水泵
 *   [27]    IMU 诊断码  0=正常 1=SCL拉不高 2=SDA拉不高 3=总线死 4=无应答 5=读出错
 *                      6=加速度正常但角速度恒为 0
 *   [28]    IMU 扫描到的 I2C 地址 (0 = 没扫到)
 *   [29]    帧序号(自增), 上位机据此发现丢帧
 *   [30]    IMU 寄存器体检标志位: bit0 版本号 bit1 陀螺仪 bit2 磁力计
 *                               bit3 四元数 bit4 欧拉角  (1 = 该块读到非零数据)
 *   [31]    IMU 版本号(主版本)
 *   [32-33] IMU 内部融合的偏航角, int16, 单位 0.01 rad
 *   [34]    BCC = XOR([0..33])
 *   [35]    0x7D
 *
 *   [30..33] 是陀螺仪恒 0 时用来定位问题的: 只要 [30] 里除了 bit1 以外还有
 *   别的位置 1, 就说明模块其它功能块是活的, 问题只在陀螺仪这一块;
 *   同时 [32-33] 的偏航角还能当角速度的替代来源(对时间求导)。
 *
 *   为什么把驱动器的电流/故障码单独报出来: 目标转速和实际转速对不上时,
 *   看电流就能分清是"驱动器根本没给力"(电流≈0, 多半是故障或没使能)还是
 *   "给了力但被堵住/拖住"(电流很大) —— 这是判断轮子没劲唯一的客观依据。
 *========================================================================*/

/*========================= 想改的地方 =========================*/
#define WHEEL_DIAMETER_MM   205.0f  /* 车轮直径 mm */
#define TRACK_WIDTH_MM      930.0f  /* 左右轮触地间距 mm */

#define MAX_RPM             200     /* 单轮转速上限 */
#define MAX_YAW_RATE        3.0f    /* 车体角速度限幅 rad/s */

#define MOTOR1_IS_LEFT         1    /* 1=1号电机在左侧; 若左右反了改成 0 */
#define MOTOR1_INVERT          0    /* 某个轮子转向相反时改成 1 */
#define MOTOR2_INVERT          1    /* 实测2号电机正方向是反的 */

/*---------------------- 待机时的电机状态 ----------------------------
 *   没有命令(或收到零速度)时、以及断链看门狗触发时, 一律发 STOP_CTRL。
 *   想换待机手感只改这一个宏:
 *     CTRL_BRAKE (03)   动态制动, 相线短接。转速越低制动力越小 -> 慢慢推很轻
 *     CTRL_DISABLE(02)  完全松开, 轮子自由滑行
 *     CTRL_ENABLE(01)+0 速度环有静区: 不推时误差0、输出0 -> 慢慢推也不出力
 *
 *   历史教训: 这里曾经做过"位置模式锁位"(先刹停 -> 切 MODE_POSITION ->
 *   死守驱动器回码里的 m1_pos/m2_pos)。它会把驱动器切出速度模式, 再靠一路
 *   陈旧的绝对位置目标维持, 平白多出"模式切换"和"位置目标"两个变量 ——
 *   实测在车上出现了失控。已删除。
 *   现在的停车路径是**无状态**的: 每个控制周期重发同一条帧, 不记忆、不切换。
 *-----------------------------------------------------------------*/
#define STOP_CTRL           CTRL_BRAKE

/*---------------------- 串口 / 看门狗 ----------------------------
 *   只有一个上位机: USART1 (PA9/PA10) -> CH340 / RK3588。
 *   LINK_TIMEOUT_MS: 上位机这么久不发命令就自动停车(看门狗)。
 *-----------------------------------------------------------------*/
#define MAIN_BAUD           115200  /* 对齐厂商驱动, 别改 */
#define LINK_TIMEOUT_MS     800

/*---------------------- GPIO 继电器 (外设开关) ----------------------
 *   PB0 -> 电机继电器 IN     PB1 -> 水泵继电器 IN
 *
 *   ★ 接线铁律: 模块的 VCC/GND 一定要和 STM32 共用同一个电源参考，
 *     最省事的做法就是直接从本板引 5V 和 GND。
 *     曾经用独立 5V 供电(没共地)时，光耦输入回路没有稳定的返回路径，
 *     驱动电流时有时无 -> 光耦半开 -> 线圈半通电 -> 继电器持续嗡嗡响。
 *     改成从本板取 5V/GND 后立刻正常。线也要短、要粗。
 *
 *   触发电平(本车实测): 模块是低电平触发，所以下面用 1。
 *     IN 给低 -> 继电器吸合(负载通电)      IN 给高 -> 断开
 *   换模块后如果"开/关"反了，把这个值改成 0 即可。
 *   模块上如果有 H/L 跳线，拨到 L。
 *
 *   RELAY_OFF_ON_LINK_LOSS: 链路断了(看门狗)自动断开两个继电器。
 *-----------------------------------------------------------------*/
#define RELAY_MOTOR_PIN     GPIO_Pin_0      /* PB0 */
#define RELAY_PUMP_PIN      GPIO_Pin_1      /* PB1 */
#define RELAY_PORT          GPIOB
#define RELAY_ACTIVE_LOW    1               /* 1=低电平触发(实测) 0=高电平触发 */
#define RELAY_OFF_ON_LINK_LOSS  1
/*=============================================================*/

/*-------------------------- 物理换算 ------------------------------*/
#define WHEEL_CIRC_M        (3.14159265f * WHEEL_DIAMETER_MM / 1000.0f)  /* 0.64403 m */
#define TRACK_WIDTH_M       (TRACK_WIDTH_MM / 1000.0f)                   /* 0.930 m */
#define MAX_LIN_SPEED       (MAX_RPM * WHEEL_CIRC_M / 60.0f)             /* 2.147 m/s */

/*-------------------------- CAN --------------------------------*/
#define MOTOR1_CAN_ID      0x1101E600UL
#define MOTOR2_CAN_ID      0x1201E600UL
#define MOTOR1_REPLY_ID    (MOTOR1_CAN_ID + 1UL)   /* 控制帧回码 */
#define MOTOR2_REPLY_ID    (MOTOR2_CAN_ID + 1UL)
#define MOTOR1_REPORT_ID   (MOTOR1_CAN_ID + 3UL)   /* 定时上报帧 */

#define MODE_SPEED         0x05
#define MODE_POSITION      0x06
#define CTRL_ENABLE        0x01
#define CTRL_DISABLE       0x02
#define CTRL_BRAKE         0x03

