SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
    if (f[0] != CMD_HEAD) return 0;
    if (f[CMD_FRAME_SIZE - 1] != TEL_TAIL) return 0;
    for (i = 0; i < CMD_FRAME_SIZE - 2; i++)
    {
        bcc ^= f[i];
    }
    return (bcc == f[CMD_FRAME_SIZE - 2]);
}

/*========================= 命令帧应用 =============================
 * 只有一个上位机, 没有控制权仲裁 —— 收到合法帧就认。
 * 继电器是"锁存式开关", 任何时候都可以操作。
 *=================================================================*/
static void Cmd_Apply(uint8_t port_id, const uint8_t *f)
{
    int16_t vx_mm;
    int16_t wz_mrad;

    /* ---- 功能帧: f[1] 是功能码, 不是速度帧 ---- */
    if (f[1] == FUNC_RELAY)
    {
        Relay_Set(f[2]);            /* f[2] = 掩码 bit0 电机 bit1 水泵 */
        if (ports[port_id].ok_count != 0xFF) ports[port_id].ok_count++;
        return;
    }

    /* ---- 协议里的其它功能帧: 本工程没实现, 必须忽略 ----
     * 这些帧和速度帧同为 11 字节、同头同尾, 靠 f[1]/f[2] 区分
     * (docs/chassis-serial-protocol.md 第 6 节):
     *     f[1]=0x04             灯带       f[2]=EN, f[3..5]=RGB
     *     f[1]=1, f[2]=0xA0/0xA1 回充开关
     *     f[1]=0, f[2]=0xB0/0xB1 底盘安全防护
     * ★ 绝对不能当速度帧解析 —— 那样 f[3..8] 会被误读成 vx/wz, 车会乱窜。
     *   正常速度帧的 f[1] 只可能是 AutoRecharge(0/1), 所以 f[1]>1 一律不是速度帧。
     */
    if ((f[1] > 1) ||
        ((f[1] == 1) && ((f[2] == 0xA0) || (f[2] == 0xA1))) ||
        ((f[1] == 0) && ((f[2] == 0xB0) || (f[2] == 0xB1))))
    {
        if (ports[port_id].ok_count != 0xFF) ports[port_id].ok_count++;
        return;
    }

    /* ---- 速度帧 ---- */
    /* f[1]=AutoRecharge  f[2]=SecurityPLY  f[5..6]=vy (差速车忽略) */
    vx_mm = (int16_t)(((uint16_t)f[3] << 8) | f[4]);
    wz_mrad = (int16_t)(((uint16_t)f[7] << 8) | f[8]);
    if (ports[port_id].ok_count != 0xFF) ports[port_id].ok_count++;

    if (port_id != PORT_MAIN)
    {
        return;                     /* 只认 PA9/PA10, 别的口一律不理 */
    }

    target_vx = ClampF((float)vx_mm / 1000.0f, -MAX_LIN_SPEED, MAX_LIN_SPEED);
    target_wz = ClampF((float)wz_mrad / 1000.0f, -MAX_YAW_RATE, MAX_YAW_RATE);

    /* ★ 电机继电器必须有人自动管。
       继电器帧(f[1]=0x05)是本工程自定义的扩展, 厂商 ROS 节点不认识、永远
       不会发 —— 如果只靠上位机显式合闸, 换成 RK3588 当上位机之后电机永远
       没有电, 而 STM32 照样会发 CAN 转速命令, 现象是"目标转速有、实际为 0、
       电流≈0", 和"驱动器没给力"在诊断上完全分不出来。
       所以策略改成: 只要收到有效命令就自动合上电机继电器, 断链时由看门狗
       自动断开(见 main 里的 Relay_Set(0)) —— 不需要上位机配合, 车也不会在
       断链后自己复活。

       ★ 水泵**不**自动合闸: 误抽水的代价太大, 只能由上位机显式发 0x05 帧。 */
    if ((relay_state & 0x01) == 0)
    {
        Relay_Set((uint8_t)(relay_state | 0x01));
    }

    last_cmd_ms = g_tick_ms;
    ever_linked = 1;
    failsafe_latched = 0;
}

static void Port_Feed(uart_port_t *p, uint8_t value)
{
    uint8_t i;

    if (p->len >= CMD_FRAME_SIZE)
    {
        /* 上一帧没通过校验, 左移一字节用滑动窗口重新找帧头 */
        for (i = 1; i < CMD_FRAME_SIZE; i++)
        {
            p->frame[i - 1] = p->frame[i];
        }
        p->len = CMD_FRAME_SIZE - 1;
    }

    p->frame[p->len++] = value;

    if (p->len == CMD_FRAME_SIZE)
    {
        if (Cmd_Verify(p->frame))
        {
            Cmd_Apply(p->id, p->frame);
            p->len = 0;
        }
        else if (p->bad_count != 0xFF)
        {
            p->bad_count++;
        }
        /* 校验失败时保留数据, 下次进来左移重试 */
    }
}

static void Port_ProcessCommands(uart_port_t *p)
{
    while (p->tail != p->head)
    {
        uint8_t value = p->ring[p->tail];
        p->tail = (uint8_t)((p->tail + 1) & 0x3F);
        Port_Feed(p, value);
    }
}

/*========================= 轮速计 ==================================
 * 把两个电机的实际转速按接线校准成"左轮/右轮物理转速",
 * 再正解出车体速度 (vx, wz) 供上报。
 *=================================================================*/
static void Wheel_Update(void)
{
    int16_t a = m1_rpm;
    int16_t b = m2_rpm;
    uint8_t f1, f2;
    float v_left;
    float v_right;

    /* 驱动器掉线时实际转速会一直停在最后一个值, 必须当成 0, 否则会飘。
       同时把"新鲜度"单独记下来 —— 外环积分必须知道这个数是真值还是残值,
       拿残值积分会把修正量一路喂到限幅。 */
    f1 = ((g_tick_ms - m1_rpm_ms) > RPM_STALE_MS) ? 0 : 1;
    f2 = ((g_tick_ms - m2_rpm_ms) > RPM_STALE_MS) ? 0 : 1;
    if (!f1) a = 0;
    if (!f2) b = 0;

    /* 驱动器报的是"命令方向"上的转速, 按安装校准换算成物理方向 */
    if (MOTOR1_INVERT) a = (int16_t)(-a);
    if (MOTOR2_INVERT) b = (int16_t)(-b);

    if (MOTOR1_IS_LEFT)
    {
        wheel_left_rpm = a;
        wheel_right_rpm = b;
        wheel_left_fresh  = f1;
        wheel_right_fresh = f2;
    }
    else
    {
        wheel_left_rpm = b;
        wheel_right_rpm = a;
        wheel_left_fresh  = f2;
        wheel_right_fresh = f1;
    }

    /* 正向运动学: 左右轮线速度 -> 车体速度 (协议里上报的就是这个) */
    v_left  = (float)wheel_left_rpm  * WHEEL_CIRC_M / 60.0f;
    v_right = (float)wheel_right_rpm * WHEEL_CIRC_M / 60.0f;
    body_vx = (v_left + v_right) * 0.5f;
    body_wz = (v_right - v_left) / TRACK_WIDTH_M;
}

/*========================= 轮速外环修正 ============================
 * 按实际轮速修目标轮速, 返回真正要发给驱动器的转速。
 * 两部分: 慢积分修稳态偏差 + 定时助推破静摩擦。
 * 为什么这么分、第一版错在哪, 见上面 TRIM_* / KICK_* 那一大段。
 *
 * nominal / actual 都在物理轮速域(已按接线校准), 可以直接相减。
 *★ 输出保证: 落在 [1-TRIM_DOWN_K, 1+TRIM_UP_K] 倍名义值之内(助推另加),
 *  且**方向永远和名义值一致** —— 修正不可能把车修成倒着走。
 *=================================================================*/
static float Trim_Apply(wheel_trim_t *w, float nominal, float actual,
                        uint8_t fresh, float dt)
{
    float out;
    float kick = 0.0f;

#if TRIM_ENABLE
    float mag;
    float up;
    float dn;

    mag = fabsf(nominal);

    /*---- 不该动: 修正、助推、计时全部清零, 不留任何历史 ----*/
    if (mag < TRIM_DEADBAND_RPM)
    {
        w->trim = 0.0f;
        w->kick_until = 0;

        /* 静止够久才重新武装助推。没这一条的话, 目标在 0 附近抖动
           (比如主机反复发 0.001 m/s) 会不停触发助推, 车一窜一窜的。 */
        if (w->armed == 0)
        {
            if (w->zero_since == 0)
            {
                w->zero_since = g_tick_ms;
            }
            else if ((g_tick_ms - w->zero_since) >= KICK_REARM_MS)
            {
                w->armed = 1;
                w->zero_since = 0;
            }
        }
        return 0.0f;
    }

    /*---- 目标从"不动"变成"要动": 起一次助推 ----*/
    if (w->armed)
    {
        w->armed = 0;
        w->zero_since = 0;
        w->kick_until = g_tick_ms + KICK_MS;
    }
    if ((int32_t)(g_tick_ms - w->kick_until) < 0)
    {
        kick = KICK_RPM;
    }

    /*---- 慢积分: 只修稳态偏差。回码不新鲜就只保持, 不积分 ----*/
    if (fresh)
    {
        w->trim += TRIM_KI * (nominal - actual) * dt;
    }

    /*---- 限幅: 按名义值的比例, 不用绝对值 ----
       反向最多 -TRIM_DOWN_K 倍名义值, 所以指令的正负号永远不变。
       第一版用的是绝对 ±30 RPM, 在名义值只有 13 RPM 的原地转上把指令
       顶成了 13-30 = -17, 轮子反转、车停住 —— 比例限幅从机制上消除它。 */
    up = mag * TRIM_UP_K;
    dn = mag * TRIM_DOWN_K;
    if (up > TRIM_MAX_RPM) up = TRIM_MAX_RPM;
    if (dn > TRIM_MAX_RPM) dn = TRIM_MAX_RPM;
    if (w->trim >  up) w->trim =  up;
    if (w->trim < -dn) w->trim = -dn;

    out = nominal + w->trim;

    /* 助推按名义方向叠加 */
    if (kick > 0.0f)
    {
        out += (nominal > 0.0f) ? kick : -kick;
    }
#else
    (void)actual;
    (void)fresh;
    (void)dt;
    w->trim = 0.0f;
    w->kick_until = 0;
    out = nominal;
#endif

    out = ClampF(out, -(float)MAX_RPM, (float)MAX_RPM);

    /* ★ 最后一道保险: 修正 + 助推绝不允许把指令的方向改掉。
       名义为正就保证输出 >= 0, 名义为负就保证输出 <= 0。
       即使上面的限幅哪天被人改错了, 这一条也能兜住。 */
    if ((nominal > 0.0f) && (out < 0.0f)) out = 0.0f;
    if ((nominal < 0.0f) && (out > 0.0f)) out = 0.0f;

    return out;
}

/*========================= 差速逆解 ================================
 * 车体 (vx, wz) -> 左右轮目标转速。差速车用不到 vy。
 *   v_left  = vx - wz * b/2
 *   v_right = vx + wz * b/2
 *=================================================================*/
static void Drive_Apply(void)
{
    /* 外环积分用的真实周期。主循环里还夹着 IMU 读取(1~3ms)等开销, 实际周期
       会比 CAN_PERIOD_MS 略大; 用固定值会让 TRIM_KI 的实际含义随负载漂移,
       参数就没法标定了。异常值(第一次调用/计时器回绕/严重卡顿)兜底成标称值。 */
    static uint32_t last_trim_ms = 0;
    float dt = (float)(g_tick_ms - last_trim_ms) * 0.001f;

    float v_left = target_vx - target_wz * (TRACK_WIDTH_M * 0.5f);
    float v_right = target_vx + target_wz * (TRACK_WIDTH_M * 0.5f);
    float rpm_l = v_left / WHEEL_CIRC_M * 60.0f;
    float rpm_r = v_right / WHEEL_CIRC_M * 60.0f;
    float cmd_l;
    float cmd_r;
    int16_t m1;
    int16_t m2;

