SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
    if (ever_linked)      flags |= 0x01;
    if (failsafe_latched) flags |= 0x02;
    if (imu_ok)           flags |= 0x04;    /* 加速度最近一次读取成功 */
    if (imu_gyro_ok)      flags |= 0x08;    /* 陀螺仪自开机以来读到过非零 */
    if (reset_by_iwdg)    flags |= 0x10;    /* 上次复位是看门狗引起的(主循环卡死过) */

    f[0] = DIAG_HEAD;
    f[1] = flags;
    PutI16(&f[2],  (int16_t)(body_vx * 1000.0f));   /* 轮速正解出的车体速度 */
    PutI16(&f[4],  (int16_t)(body_wz * 1000.0f));
    PutI16(&f[6],  wheel_left_rpm);      /* 实际 */
    PutI16(&f[8],  wheel_right_rpm);
    PutI16(&f[10], target_left_rpm);     /* 目标 */
    PutI16(&f[12], target_right_rpm);
    PutI16(&f[14], m1_cur);              /* 1号驱动器 输出扭矩电流 A×10 */
    PutI16(&f[16], m2_cur);              /* 2号驱动器 输出扭矩电流 A×10 */
    f[18] = m1_fault;                    /* 1号故障码, 见 FOC_FAULT_* */
    f[19] = m2_fault;
    f[20] = m1_mode;                     /* 1号当前模式 0x05 速度 / 0x06 位置 */
    f[21] = m2_mode;
    f[22] = can_error_count;
    f[23] = ports[PORT_MAIN].bad_count;
    f[24] = ports[PORT_MAIN].ok_count;
    f[25] = ports[PORT_MAIN].overflow;
    f[26] = relay_state;                 /* bit0 电机 bit1 水泵 */
    f[27] = imu_status;                  /* YBIMU_ST_* */
    f[28] = imu_found_addr;              /* 0 = 没扫到 */
    f[29] = seq++;                       /* 帧序号, 上位机据此发现丢帧 */
    f[30] = imu_probe_flags;             /* 各功能块活没活 */
    f[31] = imu_ver_major;               /* 模块版本号 */
    PutI16(&f[32], imu_euler_yaw_crad);  /* 模块自己融合的偏航角 0.01rad */
    /* f[34] = BCC, f[35] = 0x7D 下面填 */

    for (i = 0; i < DIAG_FRAME_SIZE - 2; i++) bcc ^= f[i];
    f[DIAG_FRAME_SIZE - 2] = bcc;
    f[DIAG_FRAME_SIZE - 1] = DIAG_TAIL;

    for (i = 0; i < DIAG_FRAME_SIZE; i++) Port_SendByte(p, f[i]);
}

/*============================== main ===============================*/
int main(void)
{
    Tick_Init();
    CAN1_Init();

    /* ★ 读复位原因。IWDG 一旦触发就是"主循环卡死过", 这是必须知道的事 ——
       否则只会看到"车莫名其妙停了一下"却查不出原因。
       RCC_CSR 里的标志是掉电才清, 所以读完要主动清掉, 免得下次复位还报旧账。 */
    if (RCC_GetFlagStatus(RCC_FLAG_IWDGRST) != RESET)
    {
        reset_by_iwdg = 1;
    }
    RCC_ClearFlag();

    /* ★ CAN 一通就立刻刹车, 一毫秒都别等。
       看门狗复位时驱动器还在执行上一条命令, 每多等一毫秒车就多冲一点。
       以前这里是先 Delay_ms(200) 再刹车 —— 那个延时大概是等驱动器上电就绪
       用的, 但对"MCU 软件复位"这种情况毫无必要: 驱动器本来就是活的,
       帧发过去立刻生效。 */
    CAN1_SendStop(MOTOR1_CAN_ID);
    CAN1_SendStop(MOTOR2_CAN_ID);

    USART1_Init();          /* PA9/PA10 -> CH340 / RK3588, 唯一的上位机口 */
    Relay_Init();

    /* 独立看门狗。放在初始化后面开 —— 前面这些初始化是确定性的、不会卡,
       真正的风险在主循环里(见 IWDG_Init 的说明)。 */
    IWDG_Init();

    /* 只给驱动器/IMU 留点上电就绪的时间。
       200ms 远小于 1 秒的看门狗超时, 所以这里不用喂狗。 */
    Delay_ms(200);

    target_vx = 0.0f;
    target_wz = 0.0f;
    /* 再刹一次, 覆盖上面那 200ms */
    CAN1_SendStop(MOTOR1_CAN_ID);
    CAN1_SendStop(MOTOR2_CAN_ID);

    last_can_ms = g_tick_ms;
    last_odom_ms = g_tick_ms;
    last_tel_ms = g_tick_ms;
    last_cmd_ms = g_tick_ms;

    while (1)
    {
        IWDG_ReloadCounter();       /* 喂狗: 主循环还在转就说明没卡死 */

        Port_ProcessCommands(&ports[PORT_MAIN]);
        CAN1_Poll();

        /* 看门狗: 上位机 800ms 不发命令就自动停车, 并断开继电器。
           只有一个上位机, 它的帧直接喂狗, 不需要仲裁。 */
        if ((failsafe_latched == 0) &&
            (ever_linked) &&
            ((g_tick_ms - last_cmd_ms) > LINK_TIMEOUT_MS))
        {
            target_vx = 0.0f;
            target_wz = 0.0f;
            failsafe_latched = 1;
#if RELAY_OFF_ON_LINK_LOSS
            Relay_Set(0);       /* 断线了顺便把电机/水泵继电器也断开 */
#endif
        }

        /* 轮速采样 + IMU */
        if ((g_tick_ms - last_odom_ms) >= ODOM_PERIOD_MS)
        {
            last_odom_ms = g_tick_ms;
            Odom_Tick();
        }

        /* 逆解 + CAN 下发 */
        if ((g_tick_ms - last_can_ms) >= CAN_PERIOD_MS)
        {
            last_can_ms = g_tick_ms;
            Drive_Apply();
        }

        /* 上报: 先标准 24 字节帧, 紧跟一帧扩展诊断帧。
           顺序不能反 —— 诊断帧必须夹在两个 24 字节帧之间, 厂商节点才能
           干净地跳过它并正确重新同步。 */
        if ((g_tick_ms - last_tel_ms) >= TELEMETRY_PERIOD_MS)
        {
            last_tel_ms = g_tick_ms;

            Send_MainTelemetry(&ports[PORT_MAIN]);
            Send_DiagFrame(&ports[PORT_MAIN]);
        }

        CAN1_Poll();
        Delay_ms(1);
    }
}
